{"info":[{"protocol_no":"02","NCT":"NCT03037385","jit":"Tempus","trial_name":"Blueprint ARROW"}],"disease":[{"summary":"Solid excl MTC & NSCLC","occurence":"","details":[{"code":"Solid","selection":"include"},{"code":"MTC","selection":"exclude"},{"code":"NSCLC","selection":"exclude"}]}],"query":[{"nct":"NCT03037385","title":"Phase 1/2 Study of the Highly-selective RET Inhibitor, Pralsetinib (BLU-667), in Patients With Thyroid Cancer, Non-Small Cell Lung Cancer, and Other Advanced Solid Tumors","current_status":"Recruiting","status_verif_date":"August 2020","last_update_date":"August 21, 2020","trial_hold_status":"","sponsor":"Blueprint Medicines Corporation","brief_summary":"This is a Phase 1/2, open-label, first-in-human (FIH) study designed to evaluate the safety, tolerability, pharmacokinetics (PK), pharmacodynamics (PD), and preliminary antineoplastic activity of pralsetinib (BLU-667) administered orally in patients with medullary thyroid cancer, RET-altered NSCLC and other RET-altered solid tumors.","conditiions":"RET-altered Non Small Cell Lung Cancer | Medullary Thyroid Cancer | RET-altered Papillary Thyroid Cancer | RET-altered Colon Cancer | RET-altered Solid Tumors | Lung Neoplasm | Carcinoma, Non-Small-Cell Lung | Thyroid Diseases | Thyroid Neoplasm | Thyroid Cancer, Papillary | Carcinoma, Neuroendocrine | Respiratory Tract Neoplasms | Thoracic Neoplasms | Neoplasms by Site | Neoplasms | Lung Diseases | Respiratory Tract Disease | Carcinoma, Bronchogenic | Bronchial Neoplasms | Endocrine System Diseases | Endocrine Gland Neoplasm | Head and Neck Neoplasms | Adenocarcinoma, Papillary | Adenocarcinoma | Carcinoma | Neoplasms, Glandular and Epithelial | Neoplasms by Histologic Type | Neuroendocrine Tumors | Neuroectodermal Tumors | Neoplasms, Germ Cell and Embryonal | Neoplasms, Nerve Tissue | Colonic Neoplasms | Colorectal Neoplasms | Intestinal Neoplasms | Gastrointestinal Neoplasms | Digestive System Neoplasm | Digestive System Disease | Gastrointestinal Disease | Colonic Diseases | Intestinal Disease","type":"Interventional","phase":"Phase 1 | Phase 2","arm":[{"cohortlabel":"Phase 1 Dose Escalation","drug":"pralsetinib (BLU-667)","arm_type":"Experimental","line_of_therapy":"","arm_hold_status":"","biomarker":[{"summary":"RET fus","gene":"RET","type":"fusion","variant":"","function":"","selection":"include"}]},{"cohortlabel":"Phase 2 Dose Expansion","drug":"pralsetinib (BLU-667)","arm_type":"Experimental","line_of_therapy":"","arm_hold_status":"","biomarker":[{"summary":"RET fus","gene":"RET","type":"fusion","variant":"","function":"","selection":"include"}]}],"docs":"","min_age":"18 Years","criteria":"Key Inclusion Criteria:\n\nDiagnosis during dose escalation (Phase 1) - Pathologically documented, definitively diagnosed non-resectable advanced solid tumor.\n\nAll patients treated at doses > 120 mg per day must have medullary thyroid cancer (MTC), or a RET-altered solid tumor per local assessment of tumor tissue and/or blood.\n\nDiagnosis during dose expansion (Phase 2) - All patients (with the exception of patients with MTC enrolled in Groups 3, 4, and 9) must have an oncogenic RET-rearrangement/fusion or mutation (excluding synonymous, frameshift, and nonsense mutations) solid tumor, as determined by local or central testing of tumor or circulating tumor nucleic acid in blood; as detailed below.\n\nGroup 1 - patients must have pathologically documented, definitively diagnosed locally advanced or metastatic NSCLC with a RET fusion previously treated with a platinum-based chemotherapy.\nGroup 2 - patients must have pathologically documented, definitively diagnosed locally advanced or metastatic NSCLC with a RET fusion not previously treated with a platinum-based chemotherapy, including those who have not had any systemic therapy. Prior platinum chemotherapy in the neoadjuvant and adjuvant setting is permitted if the last dose of platinum was 4 months or more before the first dose of study drug.\nGroup 3 - patients must have pathologically documented, definitively diagnosed advanced MTC that has progressed within 14 months prior to the Screening Visit and was previously treated with cabozantinib and/or vandetanib.\nGroup 4 - patient must have pathologically documented, definitively diagnosed advanced MTC that has progressed within 14 months prior to the Screening Visit and was not previously treat with cabozantinib and/or vandetanib.\nGroup 5 -patients must have a pathologically documented, definitively diagnosed advanced solid tumor with an oncogenic RET fusion, have previously received SOC appropriate for their tumor type (unless there is no accepted standard therapy for the tumor type or the Investigator has determined that treatment with standard therapy is not appropriate), and must not be eligible for any of the other groups.\nGroup 6 - patients must have a pathologically documented, definitively diagnosed advanced solid tumor with an oncogenic RET fusion or mutation that was previously treated with a selective TKI that inhibits RET\nGroup 7 - patients must have a pathologically documented, definitively diagnosed advanced solid tumor with an oncogenic RET mutation previously treated with SOC appropriate for the tumor type and not eligible for any of the other groups\nGroup 8 - patients must have pathologically documented, definitively diagnosed locally advanced or metastatic NSCLC with a RET fusion that was previously treated with a platinum based chemotherapy (China only).\nGroup 9 - patients must have pathologically documented, definitively diagnosed advanced MTC that has progressed within 14 months prior to the Screening Visit, and was not previously treated with systemic therapy (except prior cytotoxic chemotherapy is allowed) for advanced or metastatic disease (China only).\nPatients must have non-resectable disease.\nPatient agrees to provide tumor tissue (archived, if available or a fresh biopsy) for RET status confirmation and is willing to consider an on-treatment tumor biopsy, if considered safe and medically feasible by the treating Investigator. For Phase 2, Group 6, patients are required to undergo a pretreatment biopsy to define baseline RET status in tumor tissue.\nPatient has Eastern Cooperative Oncology Group (ECOG) performance status (PS) of 0-1.\n\nKey Exclusion Criteria:\n\nPatient's cancer has a known primary driver alteration other than RET. For example, NSCLC with a targetable mutation in EGFR, ALK, ROS1 or BRAF; colorectal with an oncogenic KRAS, NRAS, or BRAF mutation.\n\nPatient has any of the following within 14 days prior to the first dose of study drug:\n\nPlatelet count < 75 × 10^9/L.\nAbsolute neutrophil count <1.0 × 10^9/L.\nHemoglobin < 9.0 g/dL (red blood cell transfusion and erythropoietin may be used to reach at least 9.0 g/dL, but must have been administered at least 2 weeks prior to the first dose of study drug.\nAspartate aminotransferase (AST) or alanine aminotransferase (ALT) > 3 × the upper limit of normal (ULN) if no hepatic metastases are present; >5 × ULN if hepatic metastases are present.\nTotal bilirubin > 1.5 × ULN; > 3 × ULN with direct bilirubin > 1.5 × ULN in presence of Gilbert's disease.\nEstimated (Cockcroft-Gault formula) or measured creatinine clearance <40 mL/min.\nTotal serum phosphorus >5.5 mg/dL\nQT interval corrected using Fridericia's formula (QTcF) >470 msec or history of prolonged QT syndrome or Torsades de pointes, or familial history of prolonged QT syndrome.\nClinically significant, uncontrolled, cardiovascular disease.\nCentral nervous system (CNS) metastases or a primary CNS tumor that is associated with progressive neurological symptoms.\nClinically symptomatic interstitial lung disease or interstitial pneumonitis including radiation pneumonitis\nPatients in Groups 1-5 and 7 (Phase 2) previously treated with a selective RET inhibitor","gender":"All","link":"<a href=\"https://clinicaltrials.gov/ct2/show/NCT03037385\" target=\"_blank\">NCT03037385<\/a>"}]}
