{"info":[{"protocol_no":"05","NCT":"NCT03940703","jit":"Tempus","trial_name":"EMD Insight 2"}],"disease":[{"summary":"NSCLC","occurence":"","details":[{"code":"NSCLC","selection":"include"}]}],"query":[{"nct":"NCT03940703","title":"A Study of Tepotinib Plus Osimertinib in Osimertinib Relapsed MET Amplified NSCLC (INSIGHT 2)","current_status":"Recruiting","status_verif_date":"March 2021","last_update_date":"March 4, 2021","trial_hold_status":"","sponsor":"EMD Serono Research & Development Institute, Inc.","brief_summary":"This study will assess the antitumor activity, safety, tolerability, and pharmacokinetics (PK) of the Mesenchymal-epithelial Transition Factor (MET) inhibitor tepotinib combined with the 3rd generation EGFR inhibitor osimertinib in participants with advanced or metastatic non-small cell lung cancer (NSCLC).","conditiions":"Non-small Cell Lung Cancer","type":"Interventional","phase":"Phase 2","arm":[{"cohortlabel":"Tepotinib and Osimertinib","drug":"Tepotinib | Osimertinib","arm_type":"Experimental","line_of_therapy":"","arm_hold_status":"","biomarker":[{"summary":"MET amp","gene":"MET","type":"amplification","variant":"","function":"","selection":"include"}]},{"cohortlabel":"Tepotinib Mono-therapy","drug":"Tepotinib | NA","arm_type":"Experimental","line_of_therapy":"","arm_hold_status":"","biomarker":[{"summary":"EGFR mut","gene":"EGFR","type":"mutation","variant":"","function":"","selection":"include"}]}],"docs":"","min_age":"18 Years","criteria":"Inclusion Criteria:\n\nLocally advanced or metastatic Non-small Cell Lung Cancer (NSCLC) histology (confirmed by either histology or cytology) with documented activating Epidermal Growth Factor Receptor (EGFR) mutation\nEastern Cooperative Oncology Group (ECOG) performance status of 0 or 1 and a minimum life expectancy of 12 weeks\nAcquired resistance on previous first-line osimertinib. Participants must meet both of the following 2 criteria:\nRadiological documentation of disease progression on first-line osimertinib\nObjective clinical benefit documented during previous osimertinib therapy, defined by either partial or complete radiological response, or durable stable disease (SD) (SD should last greater than (>) 6 months after initiation of osimertinib\nHave received only first-line osimertinib as a prior line of therapy in the non curative advanced or metastatic NSCLC setting\nMET amplification as determined by either FISH testing (central or local) on tumor tissue (TBx) or central blood-based next generation sequencing (LBx). Tumor and blood samples must be collected following progression on prior first-line osimertinib at Prescreening\nSubmission of tumor tissue and blood sample obtained after progression on first-line osimertinib, is mandatory for all patients for MET amplification testing\nSubmission of tumor tissue during Prescreening or Screening is mandatory for patients with tumor tissue tested by local FISH, to confirm MET amplification status. Central confirmation is not mandated prior to the start of study treatment\nOther protocol defined inclusion criteria could apply\n\nExclusion Criteria:\n\nSpinal cord compression or brain metastasis unless asymptomatic, stable or not requiring steroids for at least 2 weeks prior to start of study intervention\nAny unresolved toxicity Grade 2 or more according to National cancer institute common terminology criteria for adverse events( NCI-CTCAE) version 5, from previous anticancer therapy with the exception of alopecia\nInadequate hematological, liver and renal function\nImpaired cardiac function\nHistory of interstitial lung disease(ILD) or interstitial pneumonitis including radiation pneumonitis that required steroid treatment\nHypertension uncontrolled by standard therapies (not stabilized to < 150/90 millimeter of mercury (mmHg)\nContraindication to the administration of osimertinib\nOther protocol defined exclusion criteria could apply.","gender":"All","link":"<a href=\"https://clinicaltrials.gov/ct2/show/NCT03940703\" target=\"_blank\">NCT03940703<\/a>"}]}
